Revit 2017 API
Asset.LibraryName Property
The name of the library the asset belongs to.
Namespace: Autodesk.Revit.Utility
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Syntax
C#
public string LibraryName { get; }
Visual Basic
Public ReadOnly Property LibraryName As String
	Get
Visual C++
public:
property String^ LibraryName {
	String^ get ();
}
See Also
Asset Class
Autodesk.Revit.Utility Namespace